app/Http/Controllers/CategoriaController.php

select * from `categorias` order by `created_at` desc
---
    public function index()
    {
        $categorias = Categorias::orderBy('created_at', 'desc')->get();

select count(*) as aggregate from `categorias`
select * from `categorias` order by `created_at` desc
---
    public function getcategorias()
    {
        $categorias = Categorias::orderBy('created_at', 'desc')->paginate(5);