app/Http/Controllers/ItemController.php

select * from `itens_compras` where `listacompra_id` = '408'
select * from `itens` where `itens`.`id` in (71)
---
    public function getitens(Request $request, $id)
    {
        $itemCompra = ItensCompra::where('listacompra_id',$id) // onde a listacompra_id é igual ao que esta no id (url)
        ->with('itens') // traz também o relacionamento
        ->get();