app/Http/Controllers/ItensCompraController.php

    public function store(Request $request)
    {

        $data = $request->except('_token');

        $item = Itens::where('nome', $data['nome'])->first();

        if (!$item){ // se não existir

            $item = Itens::create([  // cria o item
                'nome' => $data['nome'],
            ]);
        }

        $itensCompra = ItensCompra::create([
            'item_id' => $item->id,
            'listacompra_id' => $data['listacompra_id']

        ]);
---
select * from `itens` where `nome` = 'Cerveja' limit 1
insert into `itens_compras` (`item_id`, `listacompra_id`, `updated_at`, `created_at`) values (96, null, '2024-10-20 13:54:17', '2024-10-20 13:54:17')

    public function update(Request $request, $id)
    {
        $itenscompras = ItensCompra::find($id);
        // $data=$request->except('_token');
        // // $itenscompras->update([
        // //     'quantidade' => $request->input('quantidade'),
        // //     'valor_unitario' => $request->input('valor_unitario')
        // // ]);
        $itenscompras->update([
            'quantidade' => $request->input('quantidade'),
            'valor_unitario' => $request->input('valor_unitario')
        ]);
---
update `itens_compras` set `quantidade` = '12', `valor_unitario` = null, `valor_total` = 0, `itens_compras`.`updated_at` = '2024-10-20 14:10:07' where `id` = 524