app/Http/Controllers/ListaDeComprasController.php

    public function index()
    {
        $listadecompras = Listadecompras::with('local')->paginate('10');
---
select * from `listadecompras` limit 5 offset 0
select count(*) as aggregate from `listadecompras`

    public function create(Request $request)
    {


        $itens = Itens::all();
        $locais = Locais::all();
---
select * from `itens`
select * from `locais`

    public function store(Request $request)
    {
        $data = $request->except('_token');

        if ($data['id_lista'] == '') {
            $lista = Listadecompras::create([
                'data' => date('Y-m-d'),
                'user_id' => Auth::id(),
                'local_id' => $data['local_id'],
                'meta' => $data['meta']

            ]);
        } else {
            Listadecompras::where('id', $data['id_lista'])
            ->update([
                'local_id' => $data['local_id'],
                'meta' => $data['meta']
            ]);

            $lista = Listadecompras::find($data['id_lista']); // criar essa variável para pegar o id
---
insert into `listadecompras` (`data`, `user_id`, `local_id`, `meta`, `updated_at`, `created_at`) values ('2024-10-20 00:00:00', 62, '86', null, '2024-10-20 13:18:50', '2024-10-20 13:18:50')
update `listadecompras` set `local_id` = '86', `meta` = '21', `listadecompras`.`updated_at` = '2024-10-20 13:18:51' where `id` = '409'
select * from `listadecompras` where `listadecompras`.`id` = '409' limit 1

    public function update(Request $request, $id)
    {

        $listadecompras = Listadecompras::find($id);

        $listadecompras->update([
            'meta' => $request->input('meta'),
        ]);

        $listadecompras = Listadecompras::find($id);
---
select * from `listadecompras` where `listadecompras`.`id` = '407' limit 1
update `listadecompras` set `meta` = '21', `listadecompras`.`updated_at` = '2024-10-20 12:51:39' where `id` = 407