app/Http/Controllers/LocalController.php

select * from `locais` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `locais`
---
    public function index()
    {

        $userId = Auth::id();
        $locais = Locais::orderBy('created_at', 'desc')->paginate(5);

select * from `locais` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `locais`
---
    public function getlocais()
    {

        $userId = Auth::id();
        $locais = Locais::orderBy('created_at', 'desc')->paginate(5);