app/Http/Controllers/MinhasComprasController.php

    public function index()
    {
        $listadecompras = Listadecompras::with('local')->paginate('10');
---
select * from `listadecompras` limit 10 offset 0
select count(*) as aggregate from `listadecompras`

    public function show(Request $request, $id)
    {
        $compra = Listadecompras::find($id);
---
select * from `listadecompras` where `listadecompras`.`id` = '388' limit 1